src/Reports/ОтчетОПрохожденииАттестации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ОтчетОПрохожденииАттестации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОтчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатАттестации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыАттестации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособАттестации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СплошнаяНумерация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаПодразделений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/АттестацияРаботников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>АттестацияРаботников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоставОценочныхШкалКомпетенций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАттестации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаАттестацииПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РезультатАттестации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатыАттестации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Компетенция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КомпетенцииРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ОтветственныеЛицаПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ОтветственныеЛицаПодразделений</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаместительРуководителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководительСтруктурногоПодразделения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Reports/ОтчетОПрохожденииАттестации/Ext/ObjectModule.bsl
Перем мМакет, мНомер;
Перем ТекПодр;

#Если Клиент Тогда
	
Функция СформироватьЗапросПоОтветствЛицамПод(ВыбПодразделение, ВыбОтветственноеЛицо)
  	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",ВыбПодразделение);
    Запрос.УстановитьПараметр("ОтветственноеЛицо",ВыбОтветственноеЛицо);
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(&Период, ) КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = &ОтветственноеЛицо";
	
	РезультатЗапроса = Запрос.Выполнить();
	
    Возврат РезультатЗапроса;
КонецФункции // СформируемЗапросПоЗаключенномуКонтракту(ВыбСотрудник)()
 

	
Процедура ВывестиСтрокиПодразделения(ВыборкаСтрокАттестации, ДокументРезультат)
	
	//Аверсон ЕАЕ 24.02.2025 СВФР-015001
	//Климовичи
	сНомер = 0;
	Орг = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	//Аверсон СВФР-015001
	
	Пока ВыборкаСтрокАттестации.Следующий() Цикл 
		
		ВыборкаПодразделенийСледующегоУровня = ВыборкаСтрокАттестации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		Если ПустаяСтрока(ТекПодр) или ТекПодр <> ВыборкаСтрокАттестации.ПодразделениеОрганизации Тогда			
			мНомер = 0;
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Группа1");
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииКод = СокрЛП(ВыборкаСтрокАттестации.ПодразделениеОрганизации.Код);
			ОбластьДетальныхЗаписей.Параметры.ПодразделениеОрганизацииНаименование = ВыборкаСтрокАттестации.ПодразделениеОрганизации.Наименование;				
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			мНомер = мНомер + 1;
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			сНомер = сНомер + 1;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			//ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			Если Орг.ИНН = "700103211" И СплошнаяНумерация Тогда
				ОбластьДетальныхЗаписей.Параметры.Номер = сНомер;
			Иначе
				ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			КонецЕсли;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если СпособАттестации  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестации;
				ОбластьДетальныхЗаписей.Параметры.РезультатАттестации = ВыборкаСтрокАттестации.РезультатАттестации;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.Примечание;

			ИначеЕсли СпособАттестации  = 2 Тогда
				Результат = СформироватьЗапросПоОтветствЛицамПод(ВыборкаСтрокАттестации.ПодразделениеОрганизации, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
				Пока Результат.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.РуководительФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Результат.ФизическоеЛицо.Наименование);
				КонецЦикла;				
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестацииПлановая;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		Иначе
			
			мНомер = мНомер + 1;
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			сНомер = сНомер + 1;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей = мМакет.ПолучитьОбласть("Строка");
			
			//Аверсон ЕАЕ 24.02.2025 СВФР-015001
			//Климовичи
			//ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			Если Орг.ИНН = "700103211" И СплошнаяНумерация Тогда
				ОбластьДетальныхЗаписей.Параметры.Номер = сНомер;
			Иначе
				ОбластьДетальныхЗаписей.Параметры.Номер = мНомер;
			КонецЕсли;
			//Аверсон СВФР-015001
			
			ОбластьДетальныхЗаписей.Параметры.ТН = ВыборкаСтрокАттестации.Сотрудник.Код;	
			ОбластьДетальныхЗаписей.Параметры.Сотрудник = ВыборкаСтрокАттестации.Сотрудник.Наименование;				
			ОбластьДетальныхЗаписей.Параметры.Должность = ВыборкаСтрокАттестации.Должность;
			Если СпособАттестации  = 1 Тогда
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестации;
				ОбластьДетальныхЗаписей.Параметры.РезультатАттестации = ВыборкаСтрокАттестации.РезультатАттестации;
				ОбластьДетальныхЗаписей.Параметры.Примечание = ВыборкаСтрокАттестации.Примечание;
			ИначеЕсли СпособАттестации  = 2 Тогда
				Результат = СформироватьЗапросПоОтветствЛицамПод(ВыборкаСтрокАттестации.ПодразделениеОрганизации, Перечисления.ОтветственныеЛицаПодразделений.РуководительСтруктурногоПодразделения).Выбрать();
				Пока Результат.Следующий() Цикл
					ОбластьДетальныхЗаписей.Параметры.РуководительФИО = ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Результат.ФизическоеЛицо.Наименование);
				КонецЦикла;				
				ОбластьДетальныхЗаписей.Параметры.Дата = ВыборкаСтрокАттестации.ДатаАттестацииПлановая;
			КонецЕсли;
			
			ДокументРезультат.Вывести(ОбластьДетальныхЗаписей);
			
			ТекПодр = ВыборкаСтрокАттестации.ПодразделениеОрганизации;
		КонецЕсли;
		ВывестиСтрокиПодразделения(ВыборкаПодразделенийСледующегоУровня, ДокументРезультат)
		
	КонецЦикла;//цикл по подразделениям текущего уровня 	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом
//  Дописать - булево.  Истина - табличный документ дописывается формируемым отчетом, 
//                      Ложь - заполняется формируемым отчетом (с предварительной очистой 
//                      табличного документа)
//
Процедура СформироватьОтчет(ДокументРезультат, Дописать = Ложь) Экспорт
	Если СпособАттестации  = 1 Тогда 
		мМакет = ПолучитьМакет("МакетАттестации");
	ИначеЕсли СпособАттестации  = 2 Тогда
		мМакет = ПолучитьМакет("МакетПлановойАттестации");
	конецесли;
    ТекПодр = "";
	Запрос = Новый Запрос;
	Если СпособАттестации = 1 Тогда
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая,
		|	АттестацияРаботников.Сотрудник КАК Сотрудник,
		|	АттестацияРаботников.Примечание КАК Примечание

		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АттестацияРаботников КАК АттестацияРаботников
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = АттестацияРаботников.Сотрудник
		|ГДЕ
		|	РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|	И АттестацияРаботников.ДатаАттестации МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	//1 И АттестацияРаботников.РезультатАттестации = &РезультатАттестации
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	АттестацияРаботников.Сотрудник,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая,
		|	АттестацияРаботников.Примечание
		
		|УПОРЯДОЧИТЬ ПО
		|Приоритет Возр,
		|Сотрудник";

	ИначеЕсли СпособАттестации = 2 Тогда 
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации.Приоритет КАК Приоритет,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая,
		|	АттестацияРаботников.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.РаботникиОрганизаций.СрезПоследних(&Период, ) КАК РаботникиОрганизацийСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АттестацияРаботников КАК АттестацияРаботников
		|		ПО РаботникиОрганизацийСрезПоследних.Сотрудник = АттестацияРаботников.Сотрудник
		|ГДЕ
		|	АттестацияРаботников.ДатаАттестацииПлановая МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И РаботникиОрганизацийСрезПоследних.ЗанимаемыхСтавок <> 0
		|	И РаботникиОрганизацийСрезПоследних.Организация = &Организация
		|	//1 И АттестацияРаботников.РезультатАттестации = &РезультатАттестации
		
		|СГРУППИРОВАТЬ ПО
		|	РаботникиОрганизацийСрезПоследних.Организация,
		|	РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации,
		|	АттестацияРаботников.Сотрудник,
		|	РаботникиОрганизацийСрезПоследних.Должность,
		|	АттестацияРаботников.РезультатАттестации,
		|	АттестацияРаботников.ДатаАттестации,
		|	АттестацияРаботников.ДатаАттестацииПлановая
		
		|УПОРЯДОЧИТЬ ПО
		|Приоритет Возр,
		|Сотрудник";

	КонецЕсли;
	
	Запрос.УстановитьПараметр("Период",РабочаяДата);
	Запрос.УстановитьПараметр("ДатаНачала",НачПериод);
	Запрос.УстановитьПараметр("ДатаОкончания",КонПериод);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если Не ПустаяСтрока(РезультатАттестации) тогда
		Запрос.УстановитьПараметр("РезультатАттестации",      РезультатАттестации);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"//1 И АттестацияРаботников.РезультатАттестации = &РезультатАттестации","И АттестацияРаботников.РезультатАттестации = &РезультатАттестации");
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Подразделение) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"РаботникиОрганизацийСрезПоследних.Организация = &Организация","РаботникиОрганизацийСрезПоследних.ПодразделениеОрганизации В ИЕРАРХИИ (&Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;

	Результат = Запрос.Выполнить();
	
	ДокументРезультат.Очистить();

	Область = мМакет.ПолучитьОбласть("Заголовок");
	Область.Параметры.Организация = Организация;	
	Область.Параметры.Период = ПредставлениеПериода(НачалоМесяца(НачПериод), КонецМесяца(КонПериод), "ДФ=""ММММ.гггг""");
	ДокументРезультат.Вывести(Область);
					
	//Параметры документа
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.ПолеСлева			 = 0;
	ДокументРезультат.ПолеСправа		 = 0;
		
	Область = мМакет.ПолучитьОбласть("Шапка");
	ДокументРезультат.Вывести(Область);
	
	ВыборкаИтог = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	мНомер = 0;
	ВывестиСтрокиПодразделения(ВыборкаИтог, ДокументРезультат);
	
КонецПроцедуры

#КонецЕсли
